loading_file = "<b>Гружу файл...👍</b>"

file_download_error = ("<b>Пу-пу-пу... 😬</b>\n\n"
                       "<i>Я принимаю файлы весом <b>не больше 20МБ</b>. "
                       "Если ты уверен в том, что файл соответствует ранее упомянутым "
                       "условиям — попробуй отправить его ещё раз 🥺</i>")

file_downloaded = ("<b>Файл успешно загружен!</b>\n\n"
                   "<i>Что хочешь сделать с файлом? 😏👇</i>")

unsupported_file = ("<b>Пу-пу-пу... 😬</b>\n\n"
                    "<i>Проверь, что присланный файл/формат файла поддерживаются мною. "
                    "Я принимаю только: <b>аудио/музыку</b>, <b>голосовые сообщения</b>, "
                    "<b>видео</b>, <b>видео-кружки</b> и <b>фото</b>.</i>")

start_msg = ("<b>Приветствую! 🤝</b>\n\n"
            "Я бот, который умеет обрабатывать мультимедийные файлы 😎 "
            "<b>Больше подробностей по команде /help.</b>\n\n"
             "<i>P.S. <span class='tg-spoiler'>Ток не ленись пж 😊</span></i>")

help_msg = ("<b>Вот он! Человек, который решил всё таки прочитать документацию к использованию бота 😏</b>\n\n"
            "<blockquote><b>Что я умею? 🤔</b></blockquote>\n"
            "1. Извлекать текст из аудио, видео, голосовых сообщений, видео кружков и фото;\n"
            "2. Разделять музыку на вокал и фон (минусовка);\n"
            "3. Удалять шум из аудио;\n"
            "4. Удалять фон из фото;\n"
            "5. Улучшать качество фото;\n"
            "6. Трансформировать фото в ASCII арт\n\n"
            "<blockquote><b>Какие файлы поддерживаются? 🤔</b></blockquote>\n"
            "Я принимаю только: <b>аудио/музыку</b>, <b>голосовые сообщения</b>, "
            "<b>видео</b>, <b>видео-кружки</b> и <b>фото</b>.\n\n"
            "<blockquote><b>Ограничения? ⚠️</b></blockquote>\n"
            "1. Я принимаю файлы не больше 20МБ.\n"
            "2. Я могу обрабатывать один файл за раз.\n\n"
            "<b>Вот видишь как просто? А ты не хотел читать 😉</b>")

data_lost = ("<b>Пу-пу-пу... 😬</b>\n\n"
            "<i>Данные к файлу затерялись. "
            "Скинь его снова, пожалуйста 🥺</i>")

transcribe_options = ("<b>Тебе результат текст скинуть файлом (.txt) "
                      "или в этом чате (динамично)?</b>")

transcribe_ready = "<b>📝 Транскрибация файла готова!</b>"

listening_file = "<b>🎧 Слушаю файл...</b>"

removing_bg = "<b>🖼️ Удаляю фон...</b>"

extracting_text = "<b>🖼️ Извлекаю текст...</b>"

upscaling = "<b>🖼️ Улучшаю качество...</b>"

demucs_error = ("<b>Пу-пу-пу... 😬</b>\n\n"
                "<i>Не удалось разделить файл. "
                "Скинь его снова, пожалуйста 🥺</i>")

bg_error = ("<b>Пу-пу-пу... 😬</b>\n\n"
                "<i>Не удалось удалить фон. "
                "Скинь изображение снова, пожалуйста 🥺</i>")

ocr_error = ("<b>Пу-пу-пу... 😬</b>\n\n"
                "<i>Не удалось извлечь текст. "
                "Скинь изображение снова, пожалуйста 🥺</i>")

realesrgan_error = ("<b>Пу-пу-пу... 😬</b>\n\n"
                "<i>Не удалось улучшить фото. "
                "Скинь изображение снова, пожалуйста 🥺</i>")



ascii_options = ("<b>Тебе результат скинуть в чёрно-белом ASCII "
                 "или в цветом ASCII варианте?</b>")

ascii_wait_message = "<b>🔢 Преобразую в ASCII...</b>"

ascii_ready = "<b>📝 Преобразование файла в ASCII готово!</b>"

